/*
 
 1. При нажатии на привычку и возврате обратно цветной кругляшок окрашивается в цвет привычки и появляется галочка, хотя привычка не затрекана в текущую дау
 
 2. Если удалить привычку и осле этого создать новую - цветной кругляшок сразу окрашивается в цвет привычки и появляется галочка, и нет возможности ее затрекать
 
 3. При редактировании привычки при изменении ее названия после сохранения возвращается экран с прежним заголовком.
 
 4. Если находиться на экране HabitDetailsViewController в какой-либо из привычек (с затреканной датой) и перейти по кнопке таб бара на вкладку "Информация", потом обратно на вкладку "Привычки", появляется chеckmark на самой первой дате
 
 */
